
## Plan Result (prod)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 5 to change, 40 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;USER&#34;]
* Update
  * azurerm_key_vault_secret.flexible_secret[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;USER&#34;]
* Delete
  * azurerm_key_vault_secret.db_database
  * azurerm_key_vault_secret.db_host
  * azurerm_key_vault_secret.db_password
  * azurerm_key_vault_secret.db_port
  * azurerm_key_vault_secret.db_user
  * azurerm_key_vault_secret.staging_db_database
  * azurerm_key_vault_secret.staging_db_host
  * azurerm_key_vault_secret.staging_db_password
  * azurerm_key_vault_secret.staging_db_port
  * azurerm_key_vault_secret.staging_db_user
  * module.bulk-scan-db.azurerm_postgresql_active_directory_administrator.admin
  * module.bulk-scan-db.azurerm_resource_group.data-resourcegroup
  * module.bulk-scan-db.azurerm_template_deployment.postgres-paas
  * module.bulk-scan-db.null_resource.set-user-permissions[0]
  * module.bulk-scan-db.null_resource.subnet_mappings[0]
  * module.bulk-scan-db.null_resource.subnet_mappings[1]
  * module.bulk-scan-db.null_resource.subnet_mappings[2]
  * module.bulk-scan-db.null_resource.subnet_mappings[3]
  * module.bulk-scan-db.null_resource.subnet_mappings[4]
  * module.bulk-scan-db.null_resource.subnet_mappings[5]
  * module.bulk-scan-db.null_resource.subnet_mappings[6]
  * module.bulk-scan-db.null_resource.subnet_mappings[7]
  * module.bulk-scan-db.null_resource.subnet_mappings[8]
  * module.bulk-scan-db.null_resource.subnet_mappings[9]
  * module.bulk-scan-db.random_string.password
  * module.bulk-scan-staging-db.azurerm_postgresql_active_directory_administrator.admin
  * module.bulk-scan-staging-db.azurerm_resource_group.data-resourcegroup
  * module.bulk-scan-staging-db.azurerm_template_deployment.postgres-paas
  * module.bulk-scan-staging-db.null_resource.set-user-permissions[0]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[0]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[1]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[2]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[3]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[4]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[5]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[6]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[7]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[8]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[9]
  * module.bulk-scan-staging-db.random_string.password


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.db_database will be destroyed
  # (because azurerm_key_vault_secret.db_database is not in configuration)
  - resource "azurerm_key_vault_secret" "db_database" {
      - id                      = "https://bulk-scan-prod.vault.azure.net/secrets/orchestrator-POSTGRES-DATABASE/8943132462834af4a739c8bc26e82bac" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod" -> null
      - name                    = "orchestrator-POSTGRES-DATABASE" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/orchestrator-POSTGRES-DATABASE/versions/8943132462834af4a739c8bc26e82bac" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/orchestrator-POSTGRES-DATABASE" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "8943132462834af4a739c8bc26e82bac" -> null
      - versionless_id          = "https://bulk-scan-prod.vault.azure.net/secrets/orchestrator-POSTGRES-DATABASE" -> null
    }

  # azurerm_key_vault_secret.db_host will be destroyed
  # (because azurerm_key_vault_secret.db_host is not in configuration)
  - resource "azurerm_key_vault_secret" "db_host" {
      - id                      = "https://bulk-scan-prod.vault.azure.net/secrets/orchestrator-POSTGRES-HOST/ab12a6a33e75444cb23b8eed1b2b64d5" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod" -> null
      - name                    = "orchestrator-POSTGRES-HOST" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/orchestrator-POSTGRES-HOST/versions/ab12a6a33e75444cb23b8eed1b2b64d5" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/orchestrator-POSTGRES-HOST" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "ab12a6a33e75444cb23b8eed1b2b64d5" -> null
      - versionless_id          = "https://bulk-scan-prod.vault.azure.net/secrets/orchestrator-POSTGRES-HOST" -> null
    }

  # azurerm_key_vault_secret.db_password will be destroyed
  # (because azurerm_key_vault_secret.db_password is not in configuration)
  - resource "azurerm_key_vault_secret" "db_password" {
      - id                      = "https://bulk-scan-prod.vault.azure.net/secrets/orchestrator-POSTGRES-PASS/4f04e900f4ab43e9b637c5687c0d6a8f" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod" -> null
      - name                    = "orchestrator-POSTGRES-PASS" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/orchestrator-POSTGRES-PASS/versions/4f04e900f4ab43e9b637c5687c0d6a8f" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/orchestrator-POSTGRES-PASS" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "4f04e900f4ab43e9b637c5687c0d6a8f" -> null
      - versionless_id          = "https://bulk-scan-prod.vault.azure.net/secrets/orchestrator-POSTGRES-PASS" -> null
    }

  # azurerm_key_vault_secret.db_port will be destroyed
  # (because azurerm_key_vault_secret.db_port is not in configuration)
  - resource "azurerm_key_vault_secret" "db_port" {
      - id                      = "https://bulk-scan-prod.vault.azure.net/secrets/orchestrator-POSTGRES-PORT/3ee84cb8ebb7404da328bf83529cf7f3" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod" -> null
      - name                    = "orchestrator-POSTGRES-PORT" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/orchestrator-POSTGRES-PORT/versions/3ee84cb8ebb7404da328bf83529cf7f3" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/orchestrator-POSTGRES-PORT" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "3ee84cb8ebb7404da328bf83529cf7f3" -> null
      - versionless_id          = "https://bulk-scan-prod.vault.azure.net/secrets/orchestrator-POSTGRES-PORT" -> null
    }

  # azurerm_key_vault_secret.db_user will be destroyed
  # (because azurerm_key_vault_secret.db_user is not in configuration)
  - resource "azurerm_key_vault_secret" "db_user" {
      - id                      = "https://bulk-scan-prod.vault.azure.net/secrets/orchestrator-POSTGRES-USER/184e2cbcceb84bf2a2ad930430548200" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod" -> null
      - name                    = "orchestrator-POSTGRES-USER" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/orchestrator-POSTGRES-USER/versions/184e2cbcceb84bf2a2ad930430548200" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/orchestrator-POSTGRES-USER" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "184e2cbcceb84bf2a2ad930430548200" -> null
      - versionless_id          = "https://bulk-scan-prod.vault.azure.net/secrets/orchestrator-POSTGRES-USER" -> null
    }

  # azurerm_key_vault_secret.flexible_secret["DATABASE"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-03-12T19:22:50Z" -> (known after apply)
        id                      = "https://bulk-scan-prod.vault.azure.net/secrets/orchestrator-POSTGRES-FLEXIBLE-DATABASE/fcddf6bff7694be6a5a832aa7ed66d02"
        name                    = "orchestrator-POSTGRES-FLEXIBLE-DATABASE"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["HOST"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-03-12T19:22:50Z" -> (known after apply)
        id                      = "https://bulk-scan-prod.vault.azure.net/secrets/orchestrator-POSTGRES-FLEXIBLE-HOST/651e3d9979f14d36b6d52f92fbc96984"
        name                    = "orchestrator-POSTGRES-FLEXIBLE-HOST"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PASS"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-03-12T19:22:50Z" -> (known after apply)
        id                      = "https://bulk-scan-prod.vault.azure.net/secrets/orchestrator-POSTGRES-FLEXIBLE-PASS/2cb330a3521d4d0689f221e4b97bda65"
        name                    = "orchestrator-POSTGRES-FLEXIBLE-PASS"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-03-12T19:22:50Z" -> (known after apply)
        id                      = "https://bulk-scan-prod.vault.azure.net/secrets/orchestrator-POSTGRES-FLEXIBLE-PORT/841f7c30c6734c029bfcd3500e498606"
        name                    = "orchestrator-POSTGRES-FLEXIBLE-PORT"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["USER"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-03-12T19:22:50Z" -> (known after apply)
        id                      = "https://bulk-scan-prod.vault.azure.net/secrets/orchestrator-POSTGRES-FLEXIBLE-USER/ef35e73067ec455d97ce71858d8dcab3"
        name                    = "orchestrator-POSTGRES-FLEXIBLE-USER"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["DATABASE"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod"
      + name                    = "orchestrator-POSTGRES-DATABASE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "production"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "orchestrator PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["HOST"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod"
      + name                    = "orchestrator-POSTGRES-HOST"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "production"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "orchestrator PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["PASS"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod"
      + name                    = "orchestrator-POSTGRES-PASS"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "production"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "orchestrator PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["PORT"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod"
      + name                    = "orchestrator-POSTGRES-PORT"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "production"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "orchestrator PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["USER"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod"
      + name                    = "orchestrator-POSTGRES-USER"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "production"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "orchestrator PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.staging_db_database will be destroyed
  # (because azurerm_key_vault_secret.staging_db_database is not in configuration)
  - resource "azurerm_key_vault_secret" "staging_db_database" {
      - id                      = "https://bulk-scan-prod.vault.azure.net/secrets/orchestrator-staging-postgres-database/363082a1a6a3410db9fbb4bfaad3b8f6" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod" -> null
      - name                    = "orchestrator-staging-postgres-database" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/orchestrator-staging-postgres-database/versions/363082a1a6a3410db9fbb4bfaad3b8f6" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/orchestrator-staging-postgres-database" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "363082a1a6a3410db9fbb4bfaad3b8f6" -> null
      - versionless_id          = "https://bulk-scan-prod.vault.azure.net/secrets/orchestrator-staging-postgres-database" -> null
    }

  # azurerm_key_vault_secret.staging_db_host will be destroyed
  # (because azurerm_key_vault_secret.staging_db_host is not in configuration)
  - resource "azurerm_key_vault_secret" "staging_db_host" {
      - id                      = "https://bulk-scan-prod.vault.azure.net/secrets/orchestrator-staging-postgres-host/e5f97038cd9c42d3928f3fa69e078c11" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod" -> null
      - name                    = "orchestrator-staging-postgres-host" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/orchestrator-staging-postgres-host/versions/e5f97038cd9c42d3928f3fa69e078c11" -> null
      - resourc

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

  - tags     = {
          - "application"         = "bulk-scan-print"
          - "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#rbs"
          - "environment"         = "production"
          - "managedBy"           = "Bulk Scanning and Printing"
        } -> null
    }

  # module.bulk-scan-staging-db.azurerm_template_deployment.postgres-paas will be destroyed
  # (because azurerm_template_deployment.postgres-paas is not in configuration)
  - resource "azurerm_template_deployment" "postgres-paas" {
      - deployment_mode     = "Incremental" -> null
      - id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-orchestrator-staging-data-prod/providers/Microsoft.Resources/deployments/bulk-scan-orchestrator-staging-prod" -> null
      - name                = "bulk-scan-orchestrator-staging-prod" -> null
      - outputs             = {} -> null
      - parameters          = {
          - "administratorLogin"         = "bs_orchestrator"
          - "administratorLoginPassword" = "nRLoa1xQ-A%7or&B"
          - "backupRetentionDays"        = "35"
          - "charset"                    = "utf8"
          - "collation"                  = "en-GB"
          - "commonTags"                 = "eyJhcHBsaWNhdGlvbiI6ImJ1bGstc2Nhbi1wcmludCIsImJ1aWx0RnJvbSI6Imh0dHBzOi8vZ2l0aHViLmNvbS9ITUNUUy9idWxrLXNjYW4tb3JjaGVzdHJhdG9yLmdpdCIsImJ1c2luZXNzQXJlYSI6IkNGVCIsImNvbnRhY3RTbGFja0NoYW5uZWwiOiIjcmJzIiwiZW52aXJvbm1lbnQiOiJwcm9kdWN0aW9uIiwibWFuYWdlZEJ5IjoiQnVsayBTY2FubmluZyBhbmQgUHJpbnRpbmcifQ=="
          - "dbName"                     = "bs_orchestrator"
          - "dbRules"                    = "W3sicnVsZV9uYW1lIjoiYXNlIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvODk5OWRlYzMtMDEwNC00YTI3LTk0ZWUtNjU4ODU1OTcyOWQxL3Jlc291cmNlR3JvdXBzL2NvcmUtaW5mcmEtcHJvZC9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NvcmUtaW5mcmEtdm5ldC1wcm9kL3N1Ym5ldHMvY29yZS1pbmZyYS1zdWJuZXQtMy1wcm9kIn0seyJydWxlX25hbWUiOiJjZnQtdGYtYWtzMDAiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy84Y2JjNmYzNi03YzU2LTQ5NjMtOWQzNi03MzlkYjVkMDBiMjcvcmVzb3VyY2VHcm91cHMvY2Z0LXByb2QtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NmdC1wcm9kLXZuZXQvc3VibmV0cy9ha3MtMDAifSx7InJ1bGVfbmFtZSI6ImNmdC10Zi1ha3MwMSIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzhjYmM2ZjM2LTdjNTYtNDk2My05ZDM2LTczOWRiNWQwMGIyNy9yZXNvdXJjZUdyb3Vwcy9jZnQtcHJvZC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY2Z0LXByb2Qtdm5ldC9zdWJuZXRzL2Frcy0wMSJ9LHsicnVsZV9uYW1lIjoiamVua2lucy1ha3MiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8xYmFmNTQ3MC0xYzNlLTQwZDMtYTZmNy03NGJmYmNlNGIzNDgvcmVzb3VyY2VHcm91cHMvY2Z0LXB0bC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY2Z0LXB0bC12bmV0L3N1Ym5ldHMvaWFhcyJ9LHsicnVsZV9uYW1lIjoiamVua2lucy1ha3MtYWdlbnQiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8xYmFmNTQ3MC0xYzNlLTQwZDMtYTZmNy03NGJmYmNlNGIzNDgvcmVzb3VyY2VHcm91cHMvY2Z0LXB0bC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY2Z0LXB0bC12bmV0L3N1Ym5ldHMvYWtzLTAwIn0seyJydWxlX25hbWUiOiJpZGFtLXByb2QyLXZuZXQiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy84OTk5ZGVjMy0wMTA0LTRhMjctOTRlZS02NTg4NTU5NzI5ZDEvcmVzb3VyY2VHcm91cHMvY29yZS1pbmZyYS1pZGFtLXByb2QyL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY29yZS1pbmZyYS12bmV0LWlkYW0tcHJvZDIvc3VibmV0cy9jb3JlLWluZnJhLXN1Ym5ldC03LWlkYW0tcHJvZDIifSx7InJ1bGVfbmFtZSI6ImJhc3Rpb24tcHJvZC12bmV0Iiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvMmIxYWZjMTktNWNhOS00Nzk2LWE1NmYtNTc0YTU4NjcwMjQ0L3Jlc291cmNlR3JvdXBzL2Jhc3Rpb24tcHJvZC1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2Jhc3Rpb24tcHJvZC12bmV0L3N1Ym5ldHMvYmFzdGlvbiJ9LHsicnVsZV9uYW1lIjoic2hhcmVkLXNlcnZpY2VzLXByb2QtYWtzMDAiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy81Y2E2MjAyMi02YWEyLTRjZWUtYWFhNy1lNzUzNmM4ZDU2NmMvcmVzb3VyY2VHcm91cHMvc3MtcHJvZC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3MtcHJvZC12bmV0L3N1Ym5ldHMvYWtzLTAwIn0seyJydWxlX25hbWUiOiJzaGFyZWQtc2VydmljZXMtcHJvZC1ha3MwMSIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzVjYTYyMDIyLTZhYTItNGNlZS1hYWE3LWU3NTM2YzhkNTY2Yy9yZXNvdXJjZUdyb3Vwcy9zcy1wcm9kLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9zcy1wcm9kLXZuZXQvc3VibmV0cy9ha3MtMDEifSx7InJ1bGVfbmFtZSI6InNoYXJlZC1kYXRhLWdhdGV3YXktcHJvZCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzA5NzgzMTVjLTc1ZmUtNGFkYS05ZDExLTFlYjVlMGUwYjIxNC9yZXNvdXJjZUdyb3Vwcy9obWN0cy1odWItcHJvZC1pbnQvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9obWN0cy1odWItcHJvZC1pbnQvc3VibmV0cy9zaGFyZWQtZGF0YS1nYXRld2F5In1d"
          - "env"                        = "prod"
          - "geoRedundantBackup"         = "Enabled"
          - "location"                   = "UK South"
          - "serverName"                 = "bulk-scan-orchestrator-staging-prod"
          - "skuCapacity"                = "2"
          - "skuName"                    = "GP_Gen5_2"
          - "skuSizeMB"                  = "51200"
          - "skuTier"                    = "GeneralPurpose"
          - "sslEnforcement"             = "Enabled"
          - "version"                    = "11"
        } -> null
      - resource_group_name = "bulk-scan-orchestrator-staging-data-prod" -> null
      - template_body       = jsonencode(
            {
              - "$schema"      = "http://schema.management.azure.com/schemas/2014-04-01-preview/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - administratorLogin         = {
                      - maxLength = 16
                      - minLength = 1
                      - type      = "string"
                    }
                  - administratorLoginPassword = {
                      - type = "securestring"
                    }
                  - backupRetentionDays        = {
                      - defaultValue = 7
                      - type         = "string"
                    }
                  - charset                    = {
                      - type = "string"
                    }
                  - collation                  = {
                      - type = "string"
                    }
                  - commonTags                 = {
                      - type = "string"
                    }
                  - dbName                     = {
                      - type = "string"
                    }
                  - dbRules                    = {
                      - type = "string"
                    }
                  - env                        = {
                      - metadata = {
                          - description = "The tag"
                        }
                      - type     = "string"
                    }
                  - geoRedundantBackup         = {
                      - defaultValue = "Enabled"
                      - type         = "string"
                    }
                  - location                   = {
                      - allowedValues = [
                          - "UK West",
                          - "ukwest",
                          - "UK South",
                          - "uksouth",
                        ]
                      - defaultValue  = "UK South"
                      - type          = "string"
                    }
                  - serverName                 = {
                      - maxLength = 63
                      - minLength = 2
                      - type      = "string"
                    }
                  - skuCapacity                = {
                      - defaultValue = 2
                      - type         = "string"
                    }
                  - skuFamily                  = {
                      - allowedValues = [
                          - "Gen5",
                        ]
                      - defaultValue  = "Gen5"
                      - type          = "string"
                    }
                  - skuName                    = {
                      - allowedValues = [
                          - "B_Gen5_1",
                          - "B_Gen5_2",
                          - "GP_Gen5_2",
                          - "GP_Gen5_4",
                          - "GP_Gen5_8",
                          - "GP_Gen5_16",
                          - "GP_Gen5_32",
                          - "MO_Gen5_2",
                          - "MO_Gen5_4",
                          - "MO_Gen5_8",
                          - "MO_Gen5_16",
                          - "MO_Gen5_32",
                        ]
                      - defaultValue  = "GP_Gen5_2"
                      - type          = "string"
                    }
                  - skuSizeMB                  = {
                      - defaultValue = "51200"
                      - type         = "string"
                    }
                  - skuTier                    = {
                      - allowedValues = [
                          - "Basic",
                          - "GeneralPurpose",
                          - "MemoryOptimized",
                        ]
                      - defaultValue  = "GeneralPurpose"
                      - type          = "string"
                    }
                  - sslEnforcement             = {
                      - defaultValue = "Enabled"
                      - type         = "string"
                    }
                  - version                    = {
                      - allowedValues = [
                          - "9.5",
                          - "9.6",
                          - "10",
                          - "11",
                        ]
                      - defaultValue  = "9.6"
                      - type          = "string"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2017-12-01-preview"
                      - kind       = ""
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('serverName')]"
                      - properties = {
                          - administratorLogin         = "[parameters('administratorLogin')]"
                          - administratorLoginPassword = "[parameters('administratorLoginPassword')]"
                          - sslEnforcement             = "[parameters('sslEnforcement')]"
                          - storageProfile             = {
                              - backupRetentionDays = "[int(parameters('backupRetentionDays'))]"
                              - geoRedundantBackup  = "[parameters('geoRedundantBackup')]"
                              - storageMB           = "[parameters('skuSizeMB')]"
                            }
                          - version                    = "[parameters('version')]"
                        }
                      - resources  = [
                          - {
                              - apiVersion = "2017-12-01-preview"
                              - dependsOn  = [
                                  - "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                                ]
                              - name       = "[parameters('dbName')]"
                              - properties = {
                                  - charset   = "[parameters('charset')]"
                                  - collation = "[parameters('collation')]"
                                }
                              - type       = "databases"
                            },
                        ]
                      - sku        = {
                          - capacity = "[parameters('skuCapacity')]"
                          - family   = "[parameters('skuFamily')]"
                          - name     = "[parameters('skuName')]"
                          - size     = "[parameters('skuSizeMB')]"
                          - tier     = "[parameters('skuTier')]"
                        }
                      - tags       = "[variables('tags')]"
                      - type       = "Microsoft.DBforPostgreSQL/servers"
                    },
                  - {
                      - apiVersion = "2017-12-01-preview"
                      - copy       = {
                          - count = "[length(variables('dbRules'))]"
                          - name  = "storagecopy"
                        }
                      - dependsOn  = [
                          - "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                        ]
                      - location   = "[parameters('location')]"
                      - name       = "[concat(parameters('serverName'), '/', variables('dbRules')[copyIndex()].rule_name)]"
                      - properties = {
                          - ignoreMissingVnetServiceEndpoint = true
                          - virtualNetworkSubnetId           = "[variables('dbRules')[copyIndex()].subnet_id]"
                        }
                      - type       = "Microsoft.DBforPostgreSQL/servers/virtualNetworkRules"
                    },
                ]
              - variables      = {
                  - dbRules = "[base64ToJson(parameters('dbRules'))]"
                  - tags    = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        ) -> null
    }

  # module.bulk-scan-staging-db.null_resource.set-user-permissions[0] will be destroyed
  # (because null_resource.set-user-permissions is not in configuration)
  - resource "null_resource" "set-user-permissions" {
      - id       = "7964879515797139996" -> null
      - triggers = {
          - "db_reader_user" = "DTS JIT Access bulk-scan DB Reader SC"
          - "name"           = "bulk-scan-orchestrator-staging"
          - "script_hash"    = "03f79db43eea0260e31fe3dc6925df25b0373bdeb9982b92bedf86dfd47d593a"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[0] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "8888274641428129116" -> null
      - triggers = {
          - "rule_name" = "ase"
          - "subnet_id" = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-prod/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-prod/subnets/core-infra-subnet-3-prod"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[1] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "5497146526205665899" -> null
      - triggers = {
          - "rule_name" = "cft-tf-aks00"
          - "subnet_id" = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/virtualNetworks/cft-prod-vnet/subnets/aks-00"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[2] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "5166187385115994675" -> null
      - triggers = {
          - "rule_name" = "cft-tf-aks01"
          - "subnet_id" = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/virtualNetworks/cft-prod-vnet/subnets/aks-01"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[3] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "8854168513607538973" -> null
      - triggers = {
          - "rule_name" = "jenkins-aks"
          - "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/iaas"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[4] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "5850553888157772185" -> null
      - triggers = {
          - "rule_name" = "jenkins-aks-agent"
          - "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/aks-00"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[5] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "3580608561756704058" -> null
      - triggers = {
          - "rule_name" = "idam-prod2-vnet"
          - "subnet_id" = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-idam-prod2/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-prod2/subnets/core-infra-subnet-7-idam-prod2"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[6] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "6540040541197583413" -> null
      - triggers = {
          - "rule_name" = "bastion-prod-vnet"
          - "subnet_id" = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/bastion-prod-rg/providers/Microsoft.Network/virtualNetworks/bastion-prod-vnet/subnets/bastion"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[7] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "3548695803093650699" -> null
      - triggers = {
          - "rule_name" = "shared-services-prod-aks00"
          - "subnet_id" = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/virtualNetworks/ss-prod-vnet/subnets/aks-00"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[8] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "5591900502821507429" -> null
      - triggers = {
          - "rule_name" = "shared-services-prod-aks01"
          - "subnet_id" = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/virtualNetworks/ss-prod-vnet/subnets/aks-01"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[9] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "2692718242614159183" -> null
      - triggers = {
          - "rule_name" = "shared-data-gateway-prod"
          - "subnet_id" = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/virtualNetworks/hmcts-hub-prod-int/subnets/shared-data-gateway"
        } -> null
    }

  # module.bulk-scan-staging-db.random_string.password will be destroyed
  # (because random_string.password is not in configuration)
  - resource "random_string" "password" {
      - id          = "nRLoa1xQ-A%7or&B" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "nRLoa1xQ-A%7or&B" -> null
      - special     = true -> null
      - upper       = true -> null
    }

Plan: 5 to add, 5 to change, 40 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2538,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->